# Pandas Series Lecture 1

In [81]:
import pandas as pd

data1=pd.Series([5,3,12,18])
print(data1)
print(type(data1))

0     5
1     3
2    12
3    18
dtype: int64
<class 'pandas.core.series.Series'>

### Data with index

In [82]:
data2=pd.Series([5,3,2,8],index=["A","B","C","D"],dtype=float,name="Python Data")
print(data2)

# {"Name":"Shivam","Age":67}

A    5.0
B    3.0
C    2.0
D    8.0
Name: Python Data, dtype: float64

### Data From Dictionary

In [83]:
dic={"std":["phy","chem","math"],"marks":[20,45,89],"rank":[2,5,7]}
ser1=pd.Series(dic)
print(ser1)
print(type(ser1))

std      [phy, chem, math]
marks         [20, 45, 89]
rank             [2, 5, 7]
dtype: object
<class 'pandas.core.series.Series'>

In [84]:
dic1={1:[34,23,23],2:[20,45,89],3:[2,5,7]}
ser2=pd.Series(dic1)
print(ser2)

# tup1=(6,7,5)
# print(type(tup1))

1    [34, 23, 23]
2    [20, 45, 89]
3       [2, 5, 7]
dtype: object

### Single Data with manual index

In [85]:
s1=pd.Series(12,index=[1,3,5,7])
print(s1)
print(type(s1))

1    12
3    12
5    12
7    12
dtype: int64
<class 'pandas.core.series.Series'>

In [86]:
s1=pd.Series([6,4,3,4],index=[1,2,3,4])
# print(s1)
s2=pd.Series([3,6,1,8],index=[1,2,3,4])
# print(s2)
print(s1-s2)

1    3
2   -2
3    2
4   -4
dtype: int64

In [87]:
s1=pd.Series(12,index=[1,2,5,7,8,9])
s2=pd.Series(12,index=[1,3,5,7])
print(s1+s2)

1    24.0
2     NaN
3     NaN
5    24.0
7    24.0
8     NaN
9     NaN
dtype: float64

### Data Frame

In [88]:
l1={"a":[1,2,4,6],"s":[4,6,8,9],"d":[2,3,5,6]}
data1=pd.DataFrame(l1)
print(data1)
print(type(data1))

   a  s  d
0  1  4  2
1  2  6  3
2  4  8  5
3  6  9  6
<class 'pandas.core.frame.DataFrame'>

### Specific Column View

In [89]:
p2={"a":[1,2,4,6],"s":[4,6,8,9],"d":[2,3,5,6]}
data2=pd.DataFrame(p2,columns=["a","s"],index=[1,3,4,5])
print(data2)
print(type(data2))

   a  s
1  1  4
3  2  6
4  4  8
5  6  9
<class 'pandas.core.frame.DataFrame'>

In [90]:
list1=[[2,3,4],[3,5,6],[2,8,4]]
d2=pd.DataFrame(list1)
print(d2)

   0  1  2
0  2  3  4
1  3  5  6
2  2  8  4

In [91]:
s1={"a":pd.Series([4,2,9,6]),"b":pd.Series([2,9,5,3])}
data2=pd.DataFrame(s1)
print(data2)
# Access the element
print("Data:",data2["a"][1])

   a  b
0  4  2
1  2  9
2  9  5
3  6  3
Data: 2

### Arithmetic operation in DataFrame

In [92]:
import pandas as pd 
d4=pd.DataFrame({"a":[1,2,4,6],"s":[4,6,8,9],"d":[2,3,5,6]})
# print(d4)
d4["sum"]=d4["a"]+d4["s"]
d4

   a  s  d  sum
0  1  4  2    5
1  2  6  3    8
2  4  8  5   12
3  6  9  6   15

In [93]:
d4["Sum"]=d4["a"]+d4["s"]+d4["d"]
d4
d4["Diff(a-s)"]=d4["a"]-d4["s"]
d4
d4["Mul(a*s)"]=d4["a"]*d4["s"]
d4
d4["Div(a/s)"]=d4["a"]/d4["s"]
d4

   a  s  d  sum  Sum  Diff(a-s)  Mul(a*s)  Div(a/s)
0  1  4  2    5    7         -3         4  0.250000
1  2  6  3    8   11         -4        12  0.333333
2  4  8  5   12   17         -4        32  0.500000
3  6  9  6   15   21         -3        54  0.666667

In [94]:
d4["Sum>20"]=d4["Sum"]>=10
d4

   a  s  d  sum  Sum  Diff(a-s)  Mul(a*s)  Div(a/s)  Sum>20
0  1  4  2    5    7         -3         4  0.250000   False
1  2  6  3    8   11         -4        12  0.333333    True
2  4  8  5   12   17         -4        32  0.500000    True
3  6  9  6   15   21         -3        54  0.666667    True

### Insert and Delete Data

In [95]:
l1={"a":[1,2,4,6],"s":[4,6,8,9],"d":[2,3,5,6]}
data1=pd.DataFrame(l1)
data1.insert(1,"Data1",[7,5,3,0])
print(data1)

   a  Data1  s  d
0  1      7  4  2
1  2      5  6  3
2  4      3  8  5
3  6      0  9  6

In [96]:
l1={"a":[1,2,4,6],"s":[4,6,8,9],"d":[2,3,5,6]}
data1=pd.DataFrame(l1)
data1.insert(3,"Data1",data1["s"])
print(data1)

   a  s  d  Data1
0  1  4  2      4
1  2  6  3      6
2  4  8  5      8
3  6  9  6      9

In [97]:
data1["new"]=data1["a"][:2]
data1

   a  s  d  Data1  new
0  1  4  2      4  1.0
1  2  6  3      6  2.0
2  4  8  5      8  NaN
3  6  9  6      9  NaN

In [98]:
# data1.pop("new")
data1.pop("Data1")
data1

   a  s  d  new
0  1  4  2  1.0
1  2  6  3  2.0
2  4  8  5  NaN
3  6  9  6  NaN

In [99]:
del data1["s"]
data1

   a  d  new
0  1  2  1.0
1  2  3  2.0
2  4  5  NaN
3  6  6  NaN